"""
어떤걸 선택해야 이득일지 분기 판단 힘들어보임(근데 본인 선택하거나 본인 이전거 선택하거나 둘 중 하나니까 생각보다 가능할수도?)
근데 이것도 dp 계단문제 느낌 ( n번까지 먹였을때 드는 총 비용 = ~) 인데 뭔가 애매하네
-> 아 뒤에서 앞을 보는 점화식이 아니라 앞에서 뒤로 채워가는 점화식으로 해야 되겠네
-> 근데 그래도 뭔가 겹쳐버려서 애매하다..이차원 dp로 분기해야하나? 0은 자신이 고른,1은 앞에서 고른. 
-> 아 그러면 되겠다 구현 시작 
-> 일단 어떻게든 식은 됐는데 초기항이..? 뭔가 순환논리에 빠지는데
------------------------
->순환 논리 깨기: 판을 2개로 나누기(AI)
1번 동물이 밥을 먹는 방법은 0번 행동을 하거나, N-1번 행동을 하거나 둘 중 하나입니다.
이를 이용해 아예 처음부터 2번의 DP를 돌립니다.
+ 먹인다'라는 개념보다는 i번째 행동(비용 A[i])을 "했는가(1), 안 했는가(0)"로 정의해보기
------------------------
-> 마지막 정답은 이미 선택 고정된 부분은 빼놓고 봐야하므로 d2에선 n-2를 봐야겠다
""" 

n = int(input())
a = list(map(int,input().split()))

d = [ [1e9]*2 for _ in range(n)]
#0번째에서 행동 한 경우 선택, 즉 행동 안한 경우 d[0][0] = 1e9 
d[0][1] = a[0]
for i in range(1,n):
    d[i][0] = d[i-1][1] 
    d[i][1] = min(d[i-1][0],d[i-1][1]) + a[i]

#0번째에서 행동 안한 경우, 즉 n-1번째에서 반드시 행동했어야 함, n-1에서 행동 안한 경우는 마찬가지로 1e9, 따라서 range 수정
d2 = [ [1e9]*2 for _ in range(n)]
d2[n-1][1] = a[n-1]
for i in range(n-1):
    d2[i][0] = d2[i-1][1] 
    d2[i][1] = min(d2[i-1][0],d2[i-1][1]) + a[i]

print( min(min(d[n-1]),min(d2[n-2])) )










