"""
잘 모르겠는데 일단 완탐으로 모든 경로 찍는건 되려나
10*10^5 = 10^6 ? (이긴한데 중간에 가지치기나 크게 점프뛰면 이거보다 작을듯)
만약 이 경로를 다 기록해놓고 2~N-1 각각 모든 경로에 대해 개수 확인한다고 하면.. 무조건 시간초과
아니면 각 경로를 기록할때, 본인이 어떤 지점 지나왔나 미리 저장해놓고 어떻게 할 방법있나?
잘 모르겠는데 일단 dfs 모든 경로 찍어보기

-> path 도달할때마다, 각자 본인의 경로 되돌아보면서 안지난 지점에 본인 길이 기록..이 가장 직관적인데,
본인 경로 매번 되돌아본다 = N만큼? 돌아봄 = 시간초과? 이부분을 뭔가 dp방식으로 시간 줄일수잇을거같은데 
잘모르겟어서 일단 여기까지 구현해보기 

-> 지금 문제가 되는게 path 저장할때 n만큼 돌아야하는거.. path dfs는 필수라
-> 근데 이걸 안돌수가있나?......... 

-> 현재 경로에, l번 길이로 도착한적이 있다면 더이상 진행안해도 된다? 이건 딴 dp긴한데 이러면 시간 얼마나 줄지?
-> dp[i][j] i번 경로에 j번 길이로 도착~~.. i는 대략 N, j는 대략 i이하... 
->계단식이니까 공간 N^2의 절반만큼 먹을텐데 메모리 초과아닌가? 
->걍 튜플로 좌표 저장해놓고 확인하면 되나?일단 이대로 해보기..
->1.애초에 경로 달라지면 안지나온 지점 확인하는거에서 틀어짐 2.이렇게 해도 근본적으로 시간초과


->0에서 continue 할때 지나온 지점 미리 기록해두면.. 더 빠르긴한데 이래도 근본적으로 skip 배열 돌긴 해야하므로..?


"""
import sys
sys.setrecursionlimit(10**9)
def dfs(k,path,l): #(k번 텔레포트 지점, 지나온 길, 지나온 길이)

    if k==n:
        pathSet = set(path)
        for i in range(2,n):
            if i in pathSet: continue
            ans[i] = min(ans[i],l)
        return 

    for i in range(m):
        if tp[k][i]=='0': continue
        path.append(k+i+1)
        dfs(k+i+1,path,l+1)
        path.pop()

n,m = map(int, input().split())
tp = ["00"]+[input() for _ in range(n)]
ans = [1e9]*(n)
dfs(1,[1],0)

ans = [x if x!=1e9 else -1 for x in ans]
print(*ans[2:])




